# Урок 4. Полезные инструменты
#
# 6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным.
# Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
#

from itertools import count, cycle

print(f'a.) { "#" * 40 }')
num_start = 3
num_stop = 10

for el in count(num_start):
    if el >= num_stop:
        break
    else:
        print(el)

print(f'b.) { "#" * 40 }')
_stop = 20
i = 0
for el in cycle('abcdefghijklmnopqrstuvwxyz'):
    if i > _stop:
        break
    print(el)
    i += 1
