# ДЗ № 2. Встроенные типы и операции с ними
#
# 3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.

dir_month = {
 0:  'зима',
 1:  'зима',
 2:  'зима',
 3:  'весна',
 4:  'весна',
 5:  'весна',
 6:  'лето',
 7:  'лето',
 8:  'лето',
 9:  'осень',
 10: 'осень',
 11: 'осень'
}

list_month = ['зима', 'зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето', 'осень', 'осень', 'осень']

user_input = int(input('Укажите месяц в виде числа от 1 до 12: ')) % 12
print(dir_month.get(user_input))
print(list_month[user_input])
