# ДЗ № 2. Встроенные типы и операции с ними
#
# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

my_list = ['homework', 2, 'task', 1, 20.54, True, 'last item']
print(my_list)
print(type(my_list))
