# ДЗ № 2. Встроенные типы и операции с ними
#
# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами.
# Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
# Если в слово длинное, выводить только первые 10 букв в слове.

left_n = 10
separator = ' '
user_input = input('Введите строку: ')
for index, el in enumerate(user_input.split(separator)):
    print(index + 1, el if len(el) <= left_n else el[:left_n])
