# Урок 5. Работа с файлами
#
# 6. Необходимо создать (не программно) текстовый файл, 
# где каждая строка описывает учебный предмет и наличие лекционных, 
# практических и лабораторных занятий по этому предмету и их количество. 
# Важно, чтобы для каждого предмета не обязательно были все типы занятий. 
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему. 
# Вывести словарь на экран.
#
# Примеры строк файла:
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
#
# Пример словаря:
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
#


def get_subjects(file):
    result = {}
    with open(file, 'r', encoding='utf-8') as f:
        for line in f:
            try:
                [key, value] = line.split(':', 1)
            except:
                continue

            if not (key in result):
                result[key] = 0

            for word in value.split():
                try:
                    result[key] += int(''.join(c for c in word if c.isdigit()))
                except:
                    pass
    return result


print(get_subjects('task06.txt'))
