# Урок 3. Функции
#
# 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел. Пользователь может продолжить ввод чисел,
# разделенных пробелом и снова нажать Enter. Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел,
# то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.
#

def app(exit_key='q'):

    prompt = f'Введите числа через пробел или \'{exit_key}\' для завершения \\>'
    message_str = 'Накопленная сумма\\>'
    message_str_final = 'Итоговая сумма\\>'
    format_ = f'%+{len(prompt)}s%i'
    result = 0

    while True:
        list_input = input(prompt).split(' ')
        for el in list_input:
            if el == exit_key:
                print(format_ % (message_str_final, result))
                return result
            if el.isdigit():
                result += int(el)
        print(format_ % (message_str, result))


app()
