# Урок 3. Функции
#
# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
#
# Подсказка: попробуйте решить задачу двумя способами.
# Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.
#

def my_func(x, y=-1):
    return x ** y if x > 0 and y < 0 else None


def my_func_v2(x, y=-1):

    if not (x > 0 and y < 0):
        return None

    result = 1
    while y < 0:
        result /= x
        y += 1

    return result


print(my_func(10, -1))
print(my_func(10, -2))
print(my_func_v2(10, -1))
print(my_func_v2(10, -2))
