# Урок 6. Объектно-ориентированное программирование
#
# 2. Реализовать класс Road (дорога).
#  
#  - определить атрибуты: length (длина), width (ширина);
#  - значения атрибутов должны передаваться при создании экземпляра класса;
#  - атрибуты сделать защищёнными;
#  - определить метод расчёта массы асфальта, необходимого для покрытия всей дороги;
#  - использовать формулу: длина*ширина*масса асфальта для покрытия 
#    одного кв. метра дороги асфальтом, толщиной в 1 см*число см толщины полотна;
#  - проверить работу метода.
#  
# Например: 20 м*5000 м*25 кг*5 см = 12500 т.
#

class Road:

    _length = 0
    _width = 0

    def __init__(self, length_in_m, width_in_m):
        self._length = length_in_m
        self._width = width_in_m

    def get_mass(self, height_in_cm, weight=25.0):
        return weight * self._width * self._length * height_in_cm


road = Road(5000, 20)
print(road.get_mass(5))

