# Задание 3 ##########################################################################################################
# Узнайте у пользователя число n.
# Найдите сумму чисел n + nn + nnn.
# Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.
#

str_n = input("Укажите число n: ")
print(f"сумма чисел {str_n} + {str_n * 2} + {str_n * 3} равна {int(str_n) + int(str_n * 2) + int(str_n * 3)}")
