# Задание 5 ##########################################################################################################
# Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма.
# Например, прибыль — выручка больше издержек,
# или убыток — издержки больше выручки.
# Выведите соответствующее сообщение.
#
# Если фирма отработала с прибылью,
# вычислите рентабельность выручки.
# Это отношение прибыли к выручке.
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчёте на одного сотрудника.
#

revenue = int(input("Укажите значение выручки фирмы: "))
costs = int(input("Укажите значение издержек фирмы: "))


if revenue < costs:
    print("Финансовый результат фирмы: убыток")
elif revenue == costs:
    print("Финансовый результат фирмы: нулевой баланс")
else:
    profit = revenue - costs
    print(f"Финансовый результат фирмы: прибыль\nрентабельность выручки: { profit / revenue:.2f}")
    while True:
        n_employees = int(input("Укажите численность сотрудников фирмы: "))
        if n_employees > 0:
            break
    print(f"Прибыль фирмы в расчёте на одного сотрудника составляет: {profit / n_employees:.2f}")
