# Задание 4 ##########################################################################################################
# Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.
#

while True:
    n = int(input("Укажите целое положительное число: "))
    if n > 0:
        break


i_max = 0
while n > 0:
    i = n % 10
    n //= 10
    if i > i_max:
        i_max = i

print("Самая большая цифра в числе: " + str(i_max))
