# Задание 1 ##########################################################################################################
# Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные,
# затем выведите на экран.
#

sName = input("Укажите ваше имя: ")
iAge = int(input("Укажите ваш возраст: "))
print(f"User:\n\tName: { sName };\n\tAge: { iAge }\nWelcome user{ 2021 - iAge }@mail.ru!")

