# Задание 2 ##########################################################################################################
# Пользователь вводит время в секундах.
# Переведите время в часы, минуты, секунды и выведите в формате чч:мм:сс.
# Используйте форматирование строк.
#

time = int(input("Укажите время в секундах в интервале значений от 0 до 86399: ")) % 86400

hh = time // 3600
time -= hh * 3600
mm = time // 60
ss = time - mm * 60

print("%.2i:%.2i:%.2i" % (hh, mm, ss))
